{
  "activation": "gelu",
  "architectures": [
    "DistilBertForTokenClassification"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "hidden_dim": 3072,
  "id2label": {
    "0": "B-DATE",
    "1": "B-DESC",
    "2": "B-LOC",
    "3": "B-NOTIF",
    "4": "B-TIME",
    "5": "I-DATE",
    "6": "I-DESC",
    "7": "I-LOC",
    "8": "I-NOTIF",
    "9": "I-TIME",
    "10": "O"
  },
  "initializer_range": 0.02,
  "label2id": {
    "B-DATE": 0,
    "B-DESC": 1,
    "B-LOC": 2,
    "B-NOTIF": 3,
    "B-TIME": 4,
    "I-DATE": 5,
    "I-DESC": 6,
    "I-LOC": 7,
    "I-NOTIF": 8,
    "I-TIME": 9,
    "O": 10
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "torch_dtype": "float32",
  "transformers_version": "4.50.1",
  "vocab_size": 30522
}
